WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_timer_support.c
static int meadow_timer_isr_pulse_width(int irq, void *context, void *arg);
static int meadow_timer_init_gated_pulse_width(struct timerInfo_s *timerInfo);
static int meadow_timer_test_gated_pulse_width(struct timerInfo_s *timerInfo);

static int meadow_timer_isr_freq_dutycycle(int irq, void *context, void *arg);
static int meadow_timer_init_freq_and_dutycycle(struct timerInfo_s *timerInfo);
static int meadow_timer_test_freq_and_dutycycle(struct timerInfo_s *timerInfo);

static int meadow_timer_isr_idle_measure(int irq, void *context, void *arg);
static int meadow_timer_init_idle_measure(struct timerInfo_s *timerInfo);
static int meadow_timer_test_idle_measure(struct timerInfo_s *timerInfo);

/****************************************************************************
 * Private Data
 ****************************************************************************/
// This is the beginning of a list of Meadow Timer Configuration (mtc) settings.
// These will eventually be set, directly or indirectly. by the .Net programmer.

// Filter out the 6us glitch from HC-SR04 when it finds no target.
static bool mtcHC_SR04Filter = true;

static bool mtcIncludeIdleMeasure = false;

// For now, select max of one mode of execution
static bool mtcPulseWidth = false;
static bool mtcFreqDutyCycle = true;

// In many cases only channels 1 or 2 will work.
static int mtcActiveChannel = 1;

// The following are all diagnostic and not production stuff
static struct timespec lastFDCTime;   // Watchdog for fdc
static uint32_t _idleRatio;
static volatile bool firstCaptureISR;
static volatile bool doCC2Overflow;
static int freqDcCount = 0;  // DEBUG

/****************************************************************************
 * Private Types
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/

// uint16_t getreg16(unsigned int addr);
// void modifyreg16(unsigned int addr, uint16_t clearbits, uint16_t setbits);
// void putreg16(regval, unsigned int addr);
// stm32_gpiowrite(pin_set, t/f);
// t/f = stm32_gpioread(pin_set);

//============================================================================
// This function is called for interrupts configured for measuring idle time
int meadow_timer_isr_idle_measure(int irq, void *context, void *arg)
{
  if(! mtcIncludeIdleMeasure)
    return OK;

  // Check the timer's Status Register
  struct timerInfo_s *timerInfo = (struct timerInfo_s *)arg;
  uint32_t timerBase = timerInfo->timerBase;
  uint16_t timStatusReg = getreg16(timerBase + STM32_GTIM_SR_OFFSET);

  // Since only counting up, UIF means overflow
  if(timStatusReg & GTIM_SR_UIF)
  {
    timStatusReg &= ~GTIM_SR_UIF;
    putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);

    // For the dile counter we keep the overflow in the upper 16-bits. This
    // makes adding the current count very fast.
    timerInfo->timerExtra1 += MEADOW_TIMER_16_BIT_OVERFLOW;
  }

  return OK;
}

//============================================================================
// This function is called for all interrupts configured for measuring frequency and
// duty cycle. Every rising edge will trigger an interrupt.
int meadow_timer_isr_freq_dutycycle(int irq, void *context, void *arg)
{
  if(!mtcFreqDutyCycle)
    return OK;
  
  firstCaptureISR = false;

  freqDcCount++;    // DEBUG CODE

  // Why are we here? Check the timer's Status Register
  struct timerInfo_s *timerInfo = (struct timerInfo_s *)arg;
  uint32_t timerBase = timerInfo->timerBase;

  uint16_t timStatusReg = getreg16(timerBase + STM32_GTIM_SR_OFFSET);

  //--------------------------------------------
  // Channel 1 interrupts are what we care about most. Why? Because the Timer
  // itself clears the capture/compare registers (CCR) on the first rising
  // leading edge. Then CCR2 stops counting on the falling edge and CCR1 stops
  // on the next leading edge.

  // Capture/Compare 1 signifies that input rising edge encountered.
  if(timStatusReg & GTIM_SR_CC1IF)
  {
    // Data input watchdog, consumer uses this to determine if data is stale
    (void)clock_gettime(CLOCK_REALTIME, &lastFDCTime);

    // Clear this interrupt bit
    timStatusReg &= ~GTIM_SR_CC1IF;

    // syslog(1, "%d $$$$$> CC1^ Rising edge\n", freqDcCount);

    // If both GTIM_SR_CC1IF and GTIM_SR_UIF bits are set in the status
    // register it means a rising edge has been sensed on the input.
    // This fact is used to start our capture cycle.
    // GTIM_SR_CC1IF indicates a channel 1 edge transition and UIF indicates
    // that the CNT value has been set (actually reset in our case).
    if(timStatusReg & GTIM_SR_UIF)
    {
      // It was found that some interrupts (like overflow i.e. UIF) would
      // arrive a bit after the channel 1 interrupt. To solve this problem it
      // was decided to process on certain rising edges. This allows other,
      // pending interrupts that would affect the result to arrive and be
      // considered in the calculations.
      timerInfo->timerState++;
      if(timerInfo->timerState > MEADOW_TIMER_STATE_OUTPUT)
        timerInfo->timerState = MEADOW_TIMER_STATE_RUN;

    switch(timerInfo->timerState)
    {
      case MEADOW_TIMER_STATE_RUN:
        // syslog(1, "%d $$$$$> CC1^ RUN\n", freqDcCount);
        timerInfo->timerCount1 = 0;  // Clear any previous values
        timerInfo->timerCount2 = 0;
        firstCaptureISR = true;       // Set true only for first interrupt of series
        doCC2Overflow = true;         // Initially CC2 overflow is captured
      break;

      case MEADOW_TIMER_STATE_WAIT:
        // syslog(1, "%d $$$$$> CC1 ^ WAIT\n", freqDcCount);
        meadow_timer_disable(timerInfo);

        // Collect counter information
        if(timerInfo->timerWidth == 16)
        {
          // Last step is adding the current count
          timerInfo->timerCount1 += (uint32_t)getreg16(timerBase + STM32_GTIM_CCR1_OFFSET);
          timerInfo->timerCount2 += (uint32_t)getreg16(timerBase + STM32_GTIM_CCR2_OFFSET);
        }
      break;

