WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_timer_support.c
      case MEADOW_TIMER_STATE_OUTPUT:
        // Save the information in a location where it can be used. The count
        // is cleared and used for calculations on every cycle
        timerInfo->timerExtra1 = timerInfo->timerCount1;
        timerInfo->timerExtra2 = timerInfo->timerCount2;

        // syslog(1, "%d $$$$$> CC1 ^ OUTPUT\n", freqDcCount);
        // When next rising edge arrives we want the timer to be ready
        meadow_timer_enable(timerInfo);
        break;

      default:
        syslog(1, "%d $$$$$> Illegal state:%d\n", freqDcCount, timerInfo->timerState);
        break;
        
      } // switch
    }   // if(timStatusReg & GTIM_SR_UIF)
  }     // if(timStatusReg & GTIM_SR_CC1IF)

  //---------------------------------------------------
  // Capture/Compare 2 interrupt signifies that input falling edge. This is
  // when the CCR2 capture stops.
  if(timStatusReg & GTIM_SR_CC2IF)
  {
    timStatusReg &= ~GTIM_SR_CC2IF;

    // Falling edge means we're done considering CCR2's value
    doCC2Overflow = false;
  }

  //--------------------------------------------
  // Since only counting up, UIF means the CNT register overflowed.
  // Note: At a clock speed of 96MHz, this interrupt is called every 683
  // microsec. So it is first and we exit if it's the only one we care about.
  //
  // UIF bit set when the first rising edge is detected which is when the
  // CNT, CC1 and CC2 registers are reset to zero, and at every overflow.
  if(timStatusReg & GTIM_SR_UIF)
  {
    timStatusReg &= ~GTIM_SR_UIF;

    // Ignore first caputure, only do this while running and this is only
    // needed for 16 bit registers.
    if(! firstCaptureISR &&
        timerInfo->timerState == MEADOW_TIMER_STATE_RUN &&
        timerInfo->timerWidth == 16)
    {

      // CNT overflow is always considered for count1, but considered for
      // count2 until first falling edge is detected.
      timerInfo->timerCount1 += MEADOW_TIMER_16_BIT_OVERFLOW;

      if(doCC2Overflow)
      {
        // UIF means overflow from CNT
        timerInfo->timerCount2 += MEADOW_TIMER_16_BIT_OVERFLOW;
      }
    }
  }

  // //--------------------------------------------
  // // These are FYI, they cannot be enabled to cause an interrupt.
  // // Ref Man: The counter value has been captured in TIMx_CCR1 register while
  // // CC1IF flag was already set.
  // if(timStatusReg & GTIM_SR_CC1OF)
  // {
  //   timStatusReg &= ~GTIM_SR_CC1OF;
    
  //   if(timerInfo->timerState != MEADOW_TIMER_STATE_RUN)
  //   {
  //     syslog(1, "%d +++> Over capture 1 detected\n", freqDcCount);
  //     sem_post(&_endFreqDCSem); // Force display
  //   }
  // }

  // if(timStatusReg & GTIM_SR_CC2OF)
  // {    
  //   timStatusReg &= ~GTIM_SR_CC2OF;

  //   if(timerInfo->timerState != MEADOW_TIMER_STATE_RUN)
  //   {
  //     syslog(1, "%d +++> Over capture 2 detected\n", freqDcCount);
  //     sem_post(&_endFreqDCSem); // Force display
  //   }
  // }

  // Clear all the bits that have been cleared
  putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
  return OK;
}

//============================================================================
// This function is called for all interrupts configured for measureing pulse width
int meadow_timer_isr_pulse_width(int irq, void *context, void *arg)
{
  if(!mtcPulseWidth)
    return OK;

  // The timer structure is returned because we told Nuttx this would be 'arg'
  struct timerInfo_s *timerInfo = (struct timerInfo_s *)arg;
  uint32_t timerBase = timerInfo->timerBase;

  // Why are we here? Check the timer's Status Register
  uint16_t timStatusReg = getreg16(timerBase + STM32_GTIM_SR_OFFSET);
  
  // Check the status register and acknowledge all interrupts
  if(timStatusReg & GTIM_SR_TIF)
  {
    // In gated mode GTIM_SR_TIF occurs when counter is started or stopped
    // Clear interrupt
    timStatusReg &= ~GTIM_SR_TIF;
    putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);

    // Read the GPIO's state.
    // Assumes high = start and low = stop. May want to allow config to specify
    bool inputState = stm32_gpioread(MEADOW_TIMER_APPROPRIATE_TIM_INPUT);
    if(!inputState)
    {
      // The input point's state indicates that the counting has stopped.
      if(timerInfo->timerWidth == 16)
        timerInfo->timerCount1 = (uint32_t)getreg16(timerInfo->timerBase + STM32_GTIM_CNT_OFFSET);
      else
        timerInfo->timerCount1 = getreg32(timerInfo->timerBase + STM32_GTIM_CNT_OFFSET);

      if(!mtcHC_SR04Filter)
      {
        sem_post(&_endPWidthSem); // Allow the requesting thread to process data
        return OK;
      }

      // Since HC-SR04 filter is requested we do the following. Why?
      // When there is no target the HC-SR04 output goes high for about 125ms
      // then low for about 150us then high again for about 6us. At 96MHz the
      // count for 6us is between 575 and 578. The following prevents this
      // effect from interfering with normally expected behavior.
      if(timerInfo->timerCount1 > 574 && timerInfo->timerCount1 < 579)
      {
        // Throw away the count. This way a zero reading is returned
        timerInfo->timerCount1 = 0;
        timerInfo->timerCount2 = 0;     // Not used here
        timerInfo->timerExtra1 = 0;
        timerInfo->timerExtra2 = 0;    // Not used here
      }
      else
      {
        sem_post(&_endPWidthSem);
      }
      return OK;
    }
  }

  //----------------------------------------------------------
  if(timStatusReg & GTIM_SR_UIF)
  {
    // GTIM_SR_UIF indicates overflow or underflow of main counter
    timerInfo->timerExtra1++;

    timStatusReg &= ~GTIM_SR_UIF;
    putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
  }

  // if(timStatusReg & GTIM_SR_BIF)
  // {
  //   // syslog(1, "+++> Break interrupt flag set\n");
  //   timStatusReg &= ~GTIM_SR_BIF;
  //   // putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
  // }
  
  // //--------------------------------------------
  // if(timStatusReg & GTIM_SR_CC1IF)
  // {
  //   syslog(1, "+++> Capture/compare interrupt flag 1\n");
  //   timStatusReg &= ~GTIM_SR_CC1IF;
  //   putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
  // }
  // if(timStatusReg & GTIM_SR_CC2IF)
  // {
  //   syslog(1, "+++> Capture/compare interrupt flag 2\n");
  //   timStatusReg &= ~GTIM_SR_CC2IF;
  //   putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
  // }
  // if(timStatusReg & GTIM_SR_CC3IF)
  // {
  //   syslog(1, "+++> Capture/compare interrupt flag 3\n");
  //   timStatusReg &= ~GTIM_SR_CC3IF;
  //   putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
  // }
  // if(timStatusReg & GTIM_SR_CC4IF)
  // {
  //   syslog(1, "+++> Capture/compare interrupt flag 4\n");
  //   timStatusReg &= ~GTIM_SR_CC4IF;
  //   putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
  // }

  // //--------------------------------------------
  // if(timStatusReg & GTIM_SR_CC1OF)
  // {
  //   syslog(1, "+++> A Capture/compare over capture interrupt 1\n");
  //   timStatusReg &= ~GTIM_SR_CC1OF;
  //   putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
  // }
  // if(timStatusReg & GTIM_SR_CC2OF)
  // {
  //   syslog(1, "+++> A Capture/compare over capture interrupt 2\n");
  //   timStatusReg &= ~GTIM_SR_CC2OF;
  //   putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
  // }
  // if(timStatusReg & GTIM_SR_CC3OF)
  // {
  //   syslog(1, "+++> A Capture/compare over capture interrupt 3\n");
  //   timStatusReg &= ~GTIM_SR_CC3OF;
  //   putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
  // }
  // if(timStatusReg & GTIM_SR_CC4OF)
  // {
  //   syslog(1, "+++> A Capture/compare over capture interrupt 4\n");
  //   timStatusReg &= ~GTIM_SR_CC4OF;
  //   putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
  // }

  // syslog(1, "+++> Interrupts exit. Status Reg:0x%04x\n", timStatusReg);

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/
int meadow_timer_support_setup()
{
  syslog(1, "--> %s@%d-timer support setup\n", __FILE__, __LINE__);

  lastFDCTime.tv_sec = 0;
  lastFDCTime.tv_nsec = 0;

  // Clear table values as needed
  for (int i = 0; i < MeadowTimerNumberOfTimers; i++)
  {
    timerData[i].timerState = 0;
    timerData[i].timerCount1 = 0;
    timerData[i].timerCount2 = 0;
    timerData[i].timerExtra1 = 0;
    timerData[i].timerExtra2 = 0;
  }

  // DIAG Used to inspect software
  stm32_configgpio(MEADOW_DEBUG_PIN_V2_A0);
  stm32_configgpio(MEADOW_DEBUG_PIN_V2_A1);
  stm32_configgpio(MEADOW_DEBUG_PIN_V2_A2);
  stm32_configgpio(MEADOW_DEBUG_PIN_V2_A3);
  stm32_configgpio(MEADOW_DEBUG_PIN_V2_A4);
  stm32_configgpio(MEADOW_DEBUG_PIN_V2_A5);

