WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_timer_support.c
  stm32_configgpio(MEADOW_TIMER_TEST_GPIO_D14_OUT);

  // DIAG output for triggering HC-SR04 to begin a distance measurement
  stm32_configgpio(MEADOW_TIMER_TEST_GPIO_D15_OUT);
  
  // TEMPORARY - this is defined just below MEADOW_TIMER_EXPERIMENT_NUMBER 
  stm32_configgpio(MEADOW_TIMER_APPROPRIATE_TIM_INPUT);

  syslog(1, "==> %s@%d-Creating timer experiment thread\n", __FILE__, __LINE__);

  // Create a thread to use for experimenting
  _meadow_timer_exp_thread = kthread_create(MEADOW_TIMER_EXPERIMENT_THREAD_NAME,
                                  MEADOW_TIMER_EXPERIMENT_THREAD_PRIORITY,
                                  MEADOW_TIMER_EXPERIMENT_THREAD_STACKSIZE,
                                  (main_t) meadow_timer_thread_func,
                                  (char *const *) NULL);
  if (_meadow_timer_exp_thread <= 0)
  {
    syslog(LOG_ERR, "%s@%d-Creation of %s kthread FAILED\n",
              __FILE__, __LINE__, MEADOW_TIMER_EXPERIMENT_THREAD_NAME);
    return -ENOEXEC;
  }

  return OK;
}

//========================================================
// New thread for running tests
// Note: the test code is only able to execute one timer at a time, except for
// the idle measurement test which always uses Timer 1
void *meadow_timer_thread_func(int argc, char *argv[])
{
  int ret;
  struct timerInfo_s *idleTimerInfo;

// #if HCOM_DIAG_OUTPUT_SYSLOG_PID_OF_NEW_THREADS > 0
  syslog(2, "New kthread [PID:%d],'%s'\n", getpid(), MEADOW_TIMER_EXPERIMENT_THREAD_NAME);
  usleep(10 * 1000);  
// #endif

  sem_init(&_endPWidthSem, 0, 0);
  sem_setprotocol(&_endPWidthSem, SEM_PRIO_NONE);
  sem_init(&_endFreqDCSem, 0, 0);
  sem_setprotocol(&_endFreqDCSem, SEM_PRIO_NONE);

  // General timer initialization
  struct timerInfo_s *timerInfo = meadow_timer_init_general(MEADOW_TIMER_EXPERIMENT_NUMBER);
  if(timerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Meadow timer init failed\n", __FILE__, __LINE__);
    return NULL;
  }

  //------------------------------------------------------
  // Setup Timer 1 to do CPU/Idle utilization
  if(mtcIncludeIdleMeasure)
  {
    // Must do general initialization for Idle meassure separately
    idleTimerInfo = meadow_timer_init_general(1);
    if(timerInfo == NULL)
    {
      syslog(LOG_ERR, "%s@%d-Meadow idle measure init general failed\n", __FILE__, __LINE__);
      return NULL;
    }

    ret = meadow_timer_init_idle_measure(idleTimerInfo);
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-Meadow idle measure init failed:%d\n", __FILE__, __LINE__, ret);
      return NULL;
    }

    // Final initialization
    meadow_timer_enable(idleTimerInfo);
  }

  //------------------------------------------------------
  if(mtcPulseWidth)
  {
    ret = meadow_timer_init_gated_pulse_width(timerInfo);
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-Meadow pulse width init failed:%d\n", __FILE__, __LINE__, ret);
      return NULL;
    }
  }

  //------------------------------------------------------
  else if(mtcFreqDutyCycle)
  {
    ret = meadow_timer_init_freq_and_dutycycle(timerInfo);
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-Meadow freq + duty cycle init failed:%d\n", __FILE__, __LINE__, ret);
      return NULL;
    }
  }
  
  // Final initialization
  meadow_timer_enable(timerInfo);

  //-----------------------------------------------------------------------
  // Now run a test to insure everything works
  while(true)
  {
    usleep(997 * 1000);

    if(mtcIncludeIdleMeasure)
    {
      ret = meadow_timer_test_idle_measure(idleTimerInfo);
      if(ret < 0)
      {
        syslog(LOG_ERR, "%s@%d-Meadow Idle Measurement init failed:%d\n", __FILE__, __LINE__, ret);
        return NULL;
      }
    }

    if(mtcPulseWidth)
    {
      // For normal testing use the following sleep. Remove to do more of a
      // torture test
      // usleep(1000 * 1000);

      ret = meadow_timer_test_gated_pulse_width(timerInfo);
      if(ret < 0)
      {
        syslog(LOG_ERR, "%s@%d-Meadow pulse width init failed:%d\n", __FILE__, __LINE__, ret);
        return NULL;
      }
    }
    else if(mtcFreqDutyCycle)
    {
      ret = meadow_timer_test_freq_and_dutycycle(timerInfo);
      if(ret < 0)
      {
        syslog(LOG_ERR, "%s@%d-Meadow freq + duty cycle init failed:%d\n", __FILE__, __LINE__, ret);
        return NULL;
      }
    }
  }

   return NULL;    // Keep compiler happy
}

//================================================================
// Test code for idle measurement
int meadow_timer_test_idle_measure(struct timerInfo_s *idleTimerInfo)
{
  // Display the info
  syslog(1, "--==--> Current Idle Ratio::%lu\n", _idleRatio);
  // syslog(1, "--==--> Current Idle Ratio::%lu, (0x%08lx), begin:0x%08lx, ended:0x%08lx, %d\n",
  //           _idleRatio, _idleRatio, _idleBeginCount, _idleEndedCount);
  return OK;
}

//================================================================
// Test code for gated pulse width
int meadow_timer_test_freq_and_dutycycle(struct timerInfo_s *timerInfo)
{
  // Just feed square wave into appropriate GPIO
  // Use this thread to capture the data and display periodically.

  // The last freq/duty cycle calculation must be no more than 5 seconds ago
  struct timespec abstime;
  clock_gettime(CLOCK_REALTIME, &abstime);
  if(lastFDCTime.tv_sec + 5 < abstime.tv_sec)
  {
    syslog(1, "---> No recent Freq/DC data available.\n");
    return  OK;
  }

  // Get the values in capture/compare register 1 and 2
  if(timerInfo->timerExtra1 > 1 &&
     timerInfo->timerExtra2 > 1 &&
     timerInfo->timerState != MEADOW_TIMER_STATE_NONE)
  {
    double dutyCycle = (double)(timerInfo->timerExtra2 * 100.0)/(double)timerInfo->timerExtra1;
    double freq = (double)(MEADOW_TIMER_DEFAULT_CLOCK)/(double)timerInfo->timerExtra1;

    syslog(1, "===> Freq:%06.4fHz, DC:%02.2f%%, Cnt1:%lu, Cnt2:%lu\n",
              freq, dutyCycle,
              timerInfo->timerExtra1,
              timerInfo->timerExtra2);
  }
  else
  {
    syslog(1, "+++> Invalid data 1:%lu, 2:%lu, state:%u. Any zeros are bad.\n",
              timerInfo->timerCount1, timerInfo->timerCount2,
              timerInfo->timerState);
  }
  
  return OK;
}

//================================================================
// Test code for gated pulse width
int meadow_timer_test_gated_pulse_width(struct timerInfo_s *timerInfo)
{
  int ret;
  int displayCount = 0;
  static uint32_t timeOutErrCnt = 0;

  // Attempt to simulate normal operation via this loop.
  // Note: this is built around the HC-SR04.

  // Clear all timer counter's
  if(timerInfo->timerWidth == 16)
    putreg16(0, timerInfo->timerBase + STM32_GTIM_CNT_OFFSET);
  else
    putreg32(0, timerInfo->timerBase + STM32_GTIM_CNT_OFFSET);
  
  timerInfo->timerExtra1 = 0;

  // Should be done by MONO code
  // Send pulse to HC-SR04, this must be at least 2us wide to signal the
  // HC-SR04 to send ultrasonic pulses and wait for the echo.
  syslog(1, "--> Sending pulse to HC-SR04\n");
  stm32_gpiowrite(MEADOW_TIMER_TEST_GPIO_D15_OUT, true);

